const socialSciMatchDB = [
    { 
        chapter: 1, q_no: 1, marks: 2, 
        A: ["1. ભવનાથનો મેળો", "2. તરણેતરનો મેળો"], 
        B: ["a. સુરેન્દ્રનગર", "b. ભરૂચ", "c. જૂનાગઢ"], 
        ans: ["1 - c", "2 - a"] 
    },
    { 
        chapter: 1, q_no: 2, marks: 2, 
        A: ["1. મોંગોલોઇડ પ્રજા", "2. ઑસ્ટ્રેલૉઇડ પ્રજા"], 
        B: ["a. નિષાદ", "b. કિરાત", "c. હબસી"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 1, q_no: 3, marks: 2, 
        A: ["1. રાણકી વાવ", "2. સૂર્યમંદિર"], 
        B: ["a. વડનગર", "b. મોઢેરા", "c. પાટણ"], 
        ans: ["1 - c", "2 - b"] 
    },
    { 
        chapter: 1, q_no: 4, marks: 2, 
        A: ["1. તાના-રીરી મહોત્સવ", "2. ઉત્તરાર્ધ નૃત્ય મહોત્સવ"], 
        B: ["a. મોઢેરા", "b. વડનગર", "c. ચાંપાનેર"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 1, q_no: 5, marks: 2, 
        A: ["1. દ્રવિડ પ્રજા", "2. આર્ય પ્રજા"], 
        B: ["a. પિતૃપ્રધાન કુટુંબપ્રથા", "b. માતૃમૂલક કુટુંબપ્રથા", "c. માત્ર વેપારી પ્રજા"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 1, q_no: 6, marks: 2, 
        A: ["1. ધોળાવીરા", "2. લોથલ"], 
        B: ["a. ધોળકા તાલુકો", "b. ભચાઉ તાલુકો", "c. રાપર તાલુકો"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 1, q_no: 7, marks: 2, 
        A: ["1. વૌઠાનો મેળો", "2. ડાંગ દરબારનો મેળો"], 
        B: ["a. આહવા", "b. અમદાવાદ", "c. પોરબંદર"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 1, q_no: 8, marks: 2, 
        A: ["1. પ્રાકૃતિક વારસો", "2. સાંસ્કૃતિક વારસો"], 
        B: ["a. માનવસર્જિત વારસો", "b. પ્રકૃતિની ભેટ", "c. વિદેશી વારસો"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 1, q_no: 9, marks: 2, 
        A: ["1. ગોળ ગધેડાનો મેળો", "2. માધવપુરનો મેળો"], 
        B: ["a. પોરબંદર", "b. દાહોદ", "c. સુરત"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 1, q_no: 10, marks: 2, 
        A: ["1. નેગ્રીટો (હબસી) પ્રજા", "2. અલ્પાઇન, ડિનારિક, આર્મેનોઇડ"], 
        B: ["a. મધ્ય એશિયામાંથી આવી", "b. આફ્રિકામાંથી બલૂચિસ્તાન થઈને આવી", "c. અગ્નિ એશિયામાંથી આવી"], 
        ans: ["1 - b", "2 - a"] 
    },
  
    { 
        chapter: 2, q_no: 1, marks: 2, 
        A: ["1. ટેરાકોટા", "2. પટોળા"], 
        B: ["a. પાટણ", "b. દક્ષિણ ભારત", "c. કાચી-પાકી માટીનાં વાસણો"], 
        ans: ["1 - c", "2 - a"] 
    },
    { 
        chapter: 2, q_no: 2, marks: 2, 
        A: ["1. સંગીત મકરંદ", "2. સંગીત રત્નાકર"], 
        B: ["a. પંડિત સારંગદેવ", "b. પંડિત નારદ", "c. પંડિત અહોબલે"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 2, q_no: 3, marks: 2, 
        A: ["1. ભરતનાટ્યમ", "2. કુચીપુડી"], 
        B: ["a. આંધ્રપ્રદેશ", "b. તમિલનાડુ", "c. કેરળ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 2, q_no: 4, marks: 2, 
        A: ["1. કથકલી", "2. કથક"], 
        B: ["a. ઉત્તર ભારત", "b. કેરળ", "c. મણિપુર"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 2, q_no: 5, marks: 2, 
        A: ["1. બીહૂ નૃત્ય", "2. ઓડિસી નૃત્ય"], 
        B: ["a. ઓડિશા", "b. અસમ", "c. પંજાબ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 2, q_no: 6, marks: 2, 
        A: ["1. મીનાકારી", "2. જડતર કામ"], 
        B: ["a. બિકાનેર", "b. જયપુર અને વારાણસી", "c. સુરત"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 2, q_no: 7, marks: 2, 
        A: ["1. બાંધણી", "2. અકીક કામ"], 
        B: ["a. જામનગર અને ભૂજ", "b. ખંભાત", "c. જૂનાગઢ"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 2, q_no: 8, marks: 2, 
        A: ["1. ભવાઈ", "2. ધમાલ નૃત્ય"], 
        B: ["a. સીદીઓનું નૃત્ય", "b. અસાઇત ઠાકર", "c. ડાંગના આદિવાસીઓનું નૃત્ય"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 2, q_no: 9, marks: 2, 
        A: ["1. મેરાયો નૃત્ય", "2. પઢાર નૃત્ય"], 
        B: ["a. બનાસકાંઠાનો વાવ તાલુકો", "b. સુરેન્દ્રનગર વિસ્તાર", "c. ડાંગ જિલ્લો"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 2, q_no: 10, marks: 2, 
        A: ["1. સંગીત પારિજાત", "2. નાટ્યશાસ્ત્ર"], 
        B: ["a. ભરતમુનિ", "b. પંડિત અહોબલે", "c. પંડિત નારદ"], 
        ans: ["1 - b", "2 - a"] 
    },
  
    { 
        chapter: 3, q_no: 1, marks: 2, 
        A: ["1. શિલ્પકલા", "2. સ્થાપત્યકલા"], 
        B: ["a. સંસ્કૃત ભાષામાં 'વાસ્તુ' શબ્દ વપરાય છે", "b. છીણી-હથોડીથી કંડારવાની કલા", "c. ચિત્ર દોરવાની કલા"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 3, q_no: 2, marks: 2, 
        A: ["1. હડપ્પા", "2. લોથલ"], 
        B: ["a. ભોગાવો નદીના કિનારે", "b. પંજાબના મોન્ટગોમરી જિલ્લામાં", "c. મહી નદીના કિનારે"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 3, q_no: 3, marks: 2, 
        A: ["1. હર્મિકા", "2. પ્રદક્ષિણાપથ"], 
        B: ["a. સ્તૂપની ચારે બાજુ ઊંચો ગોળાકાર રસ્તો", "b. સ્તૂપની ટોચની ચારે બાજુની વાડ (રેલિંગ)", "c. સ્તૂપનો મુખ્ય દરવાજો"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 3, q_no: 4, marks: 2, 
        A: ["1. સૌથી મોટું રથ મંદિર", "2. સૌથી નાનું રથ મંદિર"], 
        B: ["a. દ્રૌપદી રથ", "b. ધર્મરાજ રથ", "c. અર્જુન રથ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 3, q_no: 5, marks: 2, 
        A: ["1. બૃહદેશ્વર મંદિર", "2. મોઢેરાનું સૂર્યમંદિર"], 
        B: ["a. સોલંકી યુગનું સ્થાપત્ય", "b. ચોલ વંશનું સ્થાપત્ય", "c. પલ્લવ વંશનું સ્થાપત્ય"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 3, q_no: 6, marks: 2, 
        A: ["1. ગોપુરમ", "2. ગર્ભગૃહ"], 
        B: ["a. મંદિરનો મુખ્ય પ્રવેશદ્વાર", "b. મંદિરનો અંધકારમય ઓરડો", "c. મંદિરની ટોચનો ભાગ"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 3, q_no: 7, marks: 2, 
        A: ["1. પાલિતાણાના જૈન મંદિરો", "2. દેલવાડાના દેરા"], 
        B: ["a. માઉન્ટ આબુ", "b. શેત્રુંજય પર્વત", "c. ગિરનાર પર્વત"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 3, q_no: 8, marks: 2, 
        A: ["1. કિબલા", "2. ગલિયારા"], 
        B: ["a. મસ્જિદની અંદર આવવા-જવાનો રસ્તો", "b. મસ્જિદનો મુખ્ય ભાગ (નમાઝ પઢવાની દિશા)", "c. મસ્જિદનું પ્રાંગણ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 3, q_no: 9, marks: 2, 
        A: ["1. કુતુબમિનાર", "2. ઢાઈ દિન કા ઝોંપડા"], 
        B: ["a. અજમેર", "b. દિલ્હી", "c. આગ્રા"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 3, q_no: 10, marks: 2, 
        A: ["1. ભદ્રનો કિલ્લો અને જામા મસ્જિદ (અમદાવાદ)", "2. ચાંપાનેરની મસ્જિદ અને કિલ્લો"], 
        B: ["a. મહમદ બેગડો", "b. સુલતાન અહમદશાહ", "c. કુતુબુદ્દીન ઐબક"], 
        ans: ["1 - b", "2 - a"] 
    },

    { 
        chapter: 4, q_no: 1, marks: 2, 
        A: ["1. સૌથી પ્રાચીન વેદ", "2. સંગીતની ગંગોત્રી"], 
        B: ["a. સામવેદ", "b. ઋગ્વેદ", "c. અથર્વવેદ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 4, q_no: 2, marks: 2, 
        A: ["1. અષ્ટાધ્યાયી", "2. રામચરિતમાનસ"], 
        B: ["a. તુલસીદાસ", "b. મહર્ષિ પાણિનિ", "c. વાલ્મીકિ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 4, q_no: 3, marks: 2, 
        A: ["1. અભિજ્ઞાન શાકુંતલમ્", "2. હર્ષચરિત"], 
        B: ["a. બાણભટ્ટ", "b. કાલિદાસ", "c. ભવભૂતિ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 4, q_no: 4, marks: 2, 
        A: ["1. બૌદ્ધ ધર્મનું સાહિત્ય (ત્રિપિટક)", "2. ભારતનો પ્રથમ ઐતિહાસિક ગ્રંથ (રાજતરંગિણી)"], 
        B: ["a. કલ્હણ", "b. પાલી ભાષા", "c. પ્રાકૃત ભાષા"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 4, q_no: 5, marks: 2, 
        A: ["1. કન્નડ સાહિત્યની ત્રિપુટી", "2. તમિલ સાહિત્યનો ગ્રંથ 'કુરલ'"], 
        B: ["a. પંપા, પોન્ના અને રન્ના", "b. તિરુવલ્લુવર", "c. કંબલ"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 4, q_no: 6, marks: 2, 
        A: ["1. પૃથ્વીરાજ રાસો", "2. પદ્માવત"], 
        B: ["a. મલિક મુહમ્મદ જાયસી", "b. ચંદબરદાઈ", "c. અમીર ખુશરો"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 4, q_no: 7, marks: 2, 
        A: ["1. નાલંદા વિદ્યાપીઠ", "2. વલભી વિદ્યાપીઠ"], 
        B: ["a. ગુજરાત", "b. બિહાર", "c. ઉત્તર પ્રદેશ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 4, q_no: 8, marks: 2, 
        A: ["1. અમીર ખુશરો", "2. કૃષ્ણદેવરાય"], 
        B: ["a. આમુક્તમાલ્યદા (તેલુગુ ગ્રંથ)", "b. કિરાતુલ સદાયન", "c. પંચતંત્ર"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 4, q_no: 9, marks: 2, 
        A: ["1. પંચતંત્ર", "2. ગીત ગોવિંદ"], 
        B: ["a. જયદેવ", "b. વિષ્ણુશર્મા", "c. સોમદેવ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 4, q_no: 10, marks: 2, 
        A: ["1. વિશ્વનો સૌથી મોટો કાવ્યગ્રંથ", "2. બૌદ્ધ ધર્મનું પ્રારંભિક સાહિત્ય"], 
        B: ["a. ત્રિપિટક", "b. મહાભારત", "c. ભગવદ્ ગીતા"], 
        ans: ["1 - b", "2 - a"] 
    }





];
