const socialSciMatchDB = [
    { 
        chapter: 1, q_no: 1, marks: 2, 
        A: ["1. ભવનાથનો મેળો", "2. તરણેતરનો મેળો"], 
        B: ["a. સુરેન્દ્રનગર", "b. ભરૂચ", "c. જૂનાગઢ"], 
        ans: ["1 - c", "2 - a"] 
    },
    { 
        chapter: 1, q_no: 2, marks: 2, 
        A: ["1. મોંગોલોઇડ પ્રજા", "2. ઑસ્ટ્રેલૉઇડ પ્રજા"], 
        B: ["a. નિષાદ", "b. કિરાત", "c. હબસી"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 1, q_no: 3, marks: 2, 
        A: ["1. રાણકી વાવ", "2. સૂર્યમંદિર"], 
        B: ["a. વડનગર", "b. મોઢેરા", "c. પાટણ"], 
        ans: ["1 - c", "2 - b"] 
    },
    { 
        chapter: 1, q_no: 4, marks: 2, 
        A: ["1. તાના-રીરી મહોત્સવ", "2. ઉત્તરાર્ધ નૃત્ય મહોત્સવ"], 
        B: ["a. મોઢેરા", "b. વડનગર", "c. ચાંપાનેર"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 1, q_no: 5, marks: 2, 
        A: ["1. દ્રવિડ પ્રજા", "2. આર્ય પ્રજા"], 
        B: ["a. પિતૃપ્રધાન કુટુંબપ્રથા", "b. માતૃમૂલક કુટુંબપ્રથા", "c. માત્ર વેપારી પ્રજા"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 1, q_no: 6, marks: 2, 
        A: ["1. ધોળાવીરા", "2. લોથલ"], 
        B: ["a. ધોળકા તાલુકો", "b. ભચાઉ તાલુકો", "c. રાપર તાલુકો"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 1, q_no: 7, marks: 2, 
        A: ["1. વૌઠાનો મેળો", "2. ડાંગ દરબારનો મેળો"], 
        B: ["a. આહવા", "b. અમદાવાદ", "c. પોરબંદર"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 1, q_no: 8, marks: 2, 
        A: ["1. પ્રાકૃતિક વારસો", "2. સાંસ્કૃતિક વારસો"], 
        B: ["a. માનવસર્જિત વારસો", "b. પ્રકૃતિની ભેટ", "c. વિદેશી વારસો"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 1, q_no: 9, marks: 2, 
        A: ["1. ગોળ ગધેડાનો મેળો", "2. માધવપુરનો મેળો"], 
        B: ["a. પોરબંદર", "b. દાહોદ", "c. સુરત"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 1, q_no: 10, marks: 2, 
        A: ["1. નેગ્રીટો (હબસી) પ્રજા", "2. અલ્પાઇન, ડિનારિક, આર્મેનોઇડ"], 
        B: ["a. મધ્ય એશિયામાંથી આવી", "b. આફ્રિકામાંથી બલૂચિસ્તાન થઈને આવી", "c. અગ્નિ એશિયામાંથી આવી"], 
        ans: ["1 - b", "2 - a"] 
    },
  
    { 
        chapter: 2, q_no: 1, marks: 2, 
        A: ["1. ટેરાકોટા", "2. પટોળા"], 
        B: ["a. પાટણ", "b. દક્ષિણ ભારત", "c. કાચી-પાકી માટીનાં વાસણો"], 
        ans: ["1 - c", "2 - a"] 
    },
    { 
        chapter: 2, q_no: 2, marks: 2, 
        A: ["1. સંગીત મકરંદ", "2. સંગીત રત્નાકર"], 
        B: ["a. પંડિત સારંગદેવ", "b. પંડિત નારદ", "c. પંડિત અહોબલે"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 2, q_no: 3, marks: 2, 
        A: ["1. ભરતનાટ્યમ", "2. કુચીપુડી"], 
        B: ["a. આંધ્રપ્રદેશ", "b. તમિલનાડુ", "c. કેરળ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 2, q_no: 4, marks: 2, 
        A: ["1. કથકલી", "2. કથક"], 
        B: ["a. ઉત્તર ભારત", "b. કેરળ", "c. મણિપુર"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 2, q_no: 5, marks: 2, 
        A: ["1. બીહૂ નૃત્ય", "2. ઓડિસી નૃત્ય"], 
        B: ["a. ઓડિશા", "b. અસમ", "c. પંજાબ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 2, q_no: 6, marks: 2, 
        A: ["1. મીનાકારી", "2. જડતર કામ"], 
        B: ["a. બિકાનેર", "b. જયપુર અને વારાણસી", "c. સુરત"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 2, q_no: 7, marks: 2, 
        A: ["1. બાંધણી", "2. અકીક કામ"], 
        B: ["a. જામનગર અને ભૂજ", "b. ખંભાત", "c. જૂનાગઢ"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 2, q_no: 8, marks: 2, 
        A: ["1. ભવાઈ", "2. ધમાલ નૃત્ય"], 
        B: ["a. સીદીઓનું નૃત્ય", "b. અસાઇત ઠાકર", "c. ડાંગના આદિવાસીઓનું નૃત્ય"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 2, q_no: 9, marks: 2, 
        A: ["1. મેરાયો નૃત્ય", "2. પઢાર નૃત્ય"], 
        B: ["a. બનાસકાંઠાનો વાવ તાલુકો", "b. સુરેન્દ્રનગર વિસ્તાર", "c. ડાંગ જિલ્લો"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 2, q_no: 10, marks: 2, 
        A: ["1. સંગીત પારિજાત", "2. નાટ્યશાસ્ત્ર"], 
        B: ["a. ભરતમુનિ", "b. પંડિત અહોબલે", "c. પંડિત નારદ"], 
        ans: ["1 - b", "2 - a"] 
    },
  
    { 
        chapter: 3, q_no: 1, marks: 2, 
        A: ["1. શિલ્પકલા", "2. સ્થાપત્યકલા"], 
        B: ["a. સંસ્કૃત ભાષામાં 'વાસ્તુ' શબ્દ વપરાય છે", "b. છીણી-હથોડીથી કંડારવાની કલા", "c. ચિત્ર દોરવાની કલા"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 3, q_no: 2, marks: 2, 
        A: ["1. હડપ્પા", "2. લોથલ"], 
        B: ["a. ભોગાવો નદીના કિનારે", "b. પંજાબના મોન્ટગોમરી જિલ્લામાં", "c. મહી નદીના કિનારે"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 3, q_no: 3, marks: 2, 
        A: ["1. હર્મિકા", "2. પ્રદક્ષિણાપથ"], 
        B: ["a. સ્તૂપની ચારે બાજુ ઊંચો ગોળાકાર રસ્તો", "b. સ્તૂપની ટોચની ચારે બાજુની વાડ (રેલિંગ)", "c. સ્તૂપનો મુખ્ય દરવાજો"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 3, q_no: 4, marks: 2, 
        A: ["1. સૌથી મોટું રથ મંદિર", "2. સૌથી નાનું રથ મંદિર"], 
        B: ["a. દ્રૌપદી રથ", "b. ધર્મરાજ રથ", "c. અર્જુન રથ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 3, q_no: 5, marks: 2, 
        A: ["1. બૃહદેશ્વર મંદિર", "2. મોઢેરાનું સૂર્યમંદિર"], 
        B: ["a. સોલંકી યુગનું સ્થાપત્ય", "b. ચોલ વંશનું સ્થાપત્ય", "c. પલ્લવ વંશનું સ્થાપત્ય"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 3, q_no: 6, marks: 2, 
        A: ["1. ગોપુરમ", "2. ગર્ભગૃહ"], 
        B: ["a. મંદિરનો મુખ્ય પ્રવેશદ્વાર", "b. મંદિરનો અંધકારમય ઓરડો", "c. મંદિરની ટોચનો ભાગ"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 3, q_no: 7, marks: 2, 
        A: ["1. પાલિતાણાના જૈન મંદિરો", "2. દેલવાડાના દેરા"], 
        B: ["a. માઉન્ટ આબુ", "b. શેત્રુંજય પર્વત", "c. ગિરનાર પર્વત"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 3, q_no: 8, marks: 2, 
        A: ["1. કિબલા", "2. ગલિયારા"], 
        B: ["a. મસ્જિદની અંદર આવવા-જવાનો રસ્તો", "b. મસ્જિદનો મુખ્ય ભાગ (નમાઝ પઢવાની દિશા)", "c. મસ્જિદનું પ્રાંગણ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 3, q_no: 9, marks: 2, 
        A: ["1. કુતુબમિનાર", "2. ઢાઈ દિન કા ઝોંપડા"], 
        B: ["a. અજમેર", "b. દિલ્હી", "c. આગ્રા"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 3, q_no: 10, marks: 2, 
        A: ["1. ભદ્રનો કિલ્લો અને જામા મસ્જિદ (અમદાવાદ)", "2. ચાંપાનેરની મસ્જિદ અને કિલ્લો"], 
        B: ["a. મહમદ બેગડો", "b. સુલતાન અહમદશાહ", "c. કુતુબુદ્દીન ઐબક"], 
        ans: ["1 - b", "2 - a"] 
    },

    { 
        chapter: 4, q_no: 1, marks: 2, 
        A: ["1. સૌથી પ્રાચીન વેદ", "2. સંગીતની ગંગોત્રી"], 
        B: ["a. સામવેદ", "b. ઋગ્વેદ", "c. અથર્વવેદ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 4, q_no: 2, marks: 2, 
        A: ["1. અષ્ટાધ્યાયી", "2. રામચરિતમાનસ"], 
        B: ["a. તુલસીદાસ", "b. મહર્ષિ પાણિનિ", "c. વાલ્મીકિ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 4, q_no: 3, marks: 2, 
        A: ["1. અભિજ્ઞાન શાકુંતલમ્", "2. હર્ષચરિત"], 
        B: ["a. બાણભટ્ટ", "b. કાલિદાસ", "c. ભવભૂતિ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 4, q_no: 4, marks: 2, 
        A: ["1. બૌદ્ધ ધર્મનું સાહિત્ય (ત્રિપિટક)", "2. ભારતનો પ્રથમ ઐતિહાસિક ગ્રંથ (રાજતરંગિણી)"], 
        B: ["a. કલ્હણ", "b. પાલી ભાષા", "c. પ્રાકૃત ભાષા"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 4, q_no: 5, marks: 2, 
        A: ["1. કન્નડ સાહિત્યની ત્રિપુટી", "2. તમિલ સાહિત્યનો ગ્રંથ 'કુરલ'"], 
        B: ["a. પંપા, પોન્ના અને રન્ના", "b. તિરુવલ્લુવર", "c. કંબલ"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 4, q_no: 6, marks: 2, 
        A: ["1. પૃથ્વીરાજ રાસો", "2. પદ્માવત"], 
        B: ["a. મલિક મુહમ્મદ જાયસી", "b. ચંદબરદાઈ", "c. અમીર ખુશરો"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 4, q_no: 7, marks: 2, 
        A: ["1. નાલંદા વિદ્યાપીઠ", "2. વલભી વિદ્યાપીઠ"], 
        B: ["a. ગુજરાત", "b. બિહાર", "c. ઉત્તર પ્રદેશ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 4, q_no: 8, marks: 2, 
        A: ["1. અમીર ખુશરો", "2. કૃષ્ણદેવરાય"], 
        B: ["a. આમુક્તમાલ્યદા (તેલુગુ ગ્રંથ)", "b. કિરાતુલ સદાયન", "c. પંચતંત્ર"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 4, q_no: 9, marks: 2, 
        A: ["1. પંચતંત્ર", "2. ગીત ગોવિંદ"], 
        B: ["a. જયદેવ", "b. વિષ્ણુશર્મા", "c. સોમદેવ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 4, q_no: 10, marks: 2, 
        A: ["1. વિશ્વનો સૌથી મોટો કાવ્યગ્રંથ", "2. બૌદ્ધ ધર્મનું પ્રારંભિક સાહિત્ય"], 
        B: ["a. ત્રિપિટક", "b. મહાભારત", "c. ભગવદ્ ગીતા"], 
        ans: ["1 - b", "2 - a"] 
    },

    { 
        chapter: 5, q_no: 1, marks: 2, 
        A: ["1. રસાયણશાસ્ત્રના પિતા", "2. ગણિતશાસ્ત્રના પિતા"], 
        B: ["a. નાગાર્જુન", "b. આર્યભટ્ટ", "c. વરાહમિહિર"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 5, q_no: 2, marks: 2, 
        A: ["1. રસરત્નાકર", "2. ચરકસંહિતા"], 
        B: ["a. મહર્ષિ ચરક", "b. નાગાર્જુન", "c. વાગ્ભટ્ટ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 5, q_no: 3, marks: 2, 
        A: ["1. સુશ્રુતસંહિતા", "2. અષ્ટાંગહૃદય"], 
        B: ["a. વાગ્ભટ્ટ", "b. મહર્ષિ સુશ્રુત", "c. મહર્ષિ પતંજલિ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 5, q_no: 4, marks: 2, 
        A: ["1. લીલાવતી ગણિત", "2. આર્યભટ્ટીયમ"], 
        B: ["a. આર્યભટ્ટ", "b. ભાસ્કરાચાર્ય", "c. બ્રહ્મગુપ્ત"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 5, q_no: 5, marks: 2, 
        A: ["1. બૃહત્ સંહિતા", "2. બ્રહ્મસિદ્ધાંત"], 
        B: ["a. બ્રહ્મગુપ્ત", "b. વરાહમિહિર", "c. આર્યભટ્ટ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 5, q_no: 6, marks: 2, 
        A: ["1. શૂન્ય (0) ની શોધ", "2. સરવાળા અને બાદબાકીની શોધ"], 
        B: ["a. આર્યભટ્ટ", "b. ભાસ્કરાચાર્ય", "c. વરાહમિહિર"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 5, q_no: 7, marks: 2, 
        A: ["1. દિલ્હીનો લોહસ્તંભ", "2. નર્તકીની મૂર્તિ"], 
        B: ["a. સિંધુખીણની સંસ્કૃતિ (હડપ્પીય સંસ્કૃતિ)", "b. ગુપ્તયુગની ધાતુવિદ્યા", "c. મૌર્યયુગની ધાતુવિદ્યા"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 5, q_no: 8, marks: 2, 
        A: ["1. પારાની ભસ્મ વાપરવાની શરૂઆત", "2. વાઢકાપના ધારદાર સાધનોનો ઉલ્લેખ"], 
        B: ["a. નાગાર્જુન", "b. મહર્ષિ સુશ્રુત", "c. મહર્ષિ ચરક"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 5, q_no: 9, marks: 2, 
        A: ["1. પૃથ્વી પોતાની ધરી પર ફરે છે તેમ સાબિત કરનાર", "2. જ્યોતિષશાસ્ત્રને ત્રણ ભાગમાં વહેંચનાર"], 
        B: ["a. વરાહમિહિર", "b. આર્યભટ્ટ", "c. ભાસ્કરાચાર્ય"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 5, q_no: 10, marks: 2, 
        A: ["1. વાસ્તુશાસ્ત્રના પ્રથમ સ્થપતિ (આર્કિટેક્ટ)", "2. 15મી સદીમાં વાસ્તુશાસ્ત્રનો પુનરુદ્ધાર કરનાર"], 
        B: ["a. દેવોના સ્થપતિ વિશ્વકર્મા", "b. મેવાડના રાણા કુંભા", "c. રાજા ભોજ"], 
        ans: ["1 - a", "2 - b"] 
    },

    { 
        chapter: 6, q_no: 1, marks: 2, 
        A: ["1. અજંતાની ગુફાઓ", "2. એલિફન્ટાની ગુફાઓ"], 
        B: ["a. મહારાષ્ટ્ર (વાઘોરા નદી)", "b. મુંબઈ (ધારાપુરી)", "c. મધ્યપ્રદેશ"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 6, q_no: 2, marks: 2, 
        A: ["1. કૈલાસ મંદિર", "2. ત્રિમૂર્તિની ભવ્ય મૂર્તિ"], 
        B: ["a. એલિફન્ટાની ગુફામાં", "b. ઇલોરાની ગુફામાં (ગુફા નં. 16)", "c. મહાબલિપુરમ્ માં"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 6, q_no: 3, marks: 2, 
        A: ["1. ખજૂરાહોનાં મંદિરો", "2. કોણાર્કનું સૂર્યમંદિર"], 
        B: ["a. ઓડિશા (કાળા પેગોડા)", "b. મધ્યપ્રદેશ (ચંદેલ રાજાઓ)", "c. તમિલનાડુ (ચોલ વંશ)"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 6, q_no: 4, marks: 2, 
        A: ["1. બૃહદેશ્વર મંદિર", "2. હમ્પી નગર"], 
        B: ["a. વિજયનગર સામ્રાજ્યની રાજધાની", "b. તાંજોર (ચોલ વંશના રાજા રાજરાજ પ્રથમ)", "c. ચાલુક્ય વંશની રાજધાની"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 6, q_no: 5, marks: 2, 
        A: ["1. આગ્રાનો કિલ્લો", "2. તાજમહાલ"], 
        B: ["a. શાહજહાંએ બંધાવ્યો", "b. અકબરે બંધાવ્યો", "c. કુતુબુદ્દીન ઐબકે બંધાવ્યો"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 6, q_no: 6, marks: 2, 
        A: ["1. લાલ કિલ્લો", "2. બુલંદ દરવાજો"], 
        B: ["a. ફતેહપુર સિક્રી", "b. દિલ્હી", "c. આગ્રા"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 6, q_no: 7, marks: 2, 
        A: ["1. ધોળાવીરા", "2. ચાંપાનેર"], 
        B: ["a. પંચમહાલ જિલ્લો", "b. કચ્છ જિલ્લો (ભચાઉ તાલુકો)", "c. પાટણ જિલ્લો"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 6, q_no: 8, marks: 2, 
        A: ["1. રાણીની વાવ (રાણકી વાવ)", "2. રુદ્રમહાલય"], 
        B: ["a. સિદ્ધપુર", "b. પાટણ", "c. મોઢેરા"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 6, q_no: 9, marks: 2, 
        A: ["1. અડી-કડીની વાવ અને નવઘણ કૂવો", "2. સહસ્ત્રલિંગ તળાવ"], 
        B: ["a. જૂનાગઢ", "b. પાટણ", "c. અમદાવાદ"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 6, q_no: 10, marks: 2, 
        A: ["1. બેસાલીકા ઓફ બોમ જીસસ", "2. પટ્ટદકલ"], 
        B: ["a. ગોવાનું પ્રખ્યાત દેવળ", "b. ચાલુક્ય વંશની રાજધાનીનું નગર", "c. રાષ્ટ્રકૂટ વંશની રાજધાની"], 
        ans: ["1 - a", "2 - b"] 
    },

    { 
        chapter: 7, q_no: 1, marks: 2, 
        A: ["1. ભારતીય પુરાતત્ત્વ સર્વેક્ષણ (ASI)", "2. સ્વામી વિવેકાનંદ"], 
        B: ["a. શિકાગો વિશ્વ ધર્મ પરિષદમાં હાજરી", "b. રાષ્ટ્રીય સ્મારકોની જાળવણી", "c. ગીર ફાઉન્ડેશનની સ્થાપના"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 7, q_no: 2, marks: 2, 
        A: ["1. બંધારણનો અનુચ્છેદ 51 (ક)", "2. પ્રાચીન સ્મારકો અને પુરાતત્ત્વીય સ્થળોનો કાયદો"], 
        B: ["a. ઈ.સ. 1958", "b. નાગરિકોની મૂળભૂત ફરજો", "c. ઈ.સ. 1972"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 7, q_no: 3, marks: 2, 
        A: ["1. રાષ્ટ્રીય સંગ્રહાલય (National Museum)", "2. છત્રપતિ શિવાજી મહારાજ વાસ્તુ સંગ્રહાલય"], 
        B: ["a. નવી દિલ્હી", "b. મુંબઈ", "c. કોલકાતા"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 7, q_no: 4, marks: 2, 
        A: ["1. સાલારગંજ સંગ્રહાલય", "2. ઇન્ડિયન મ્યુઝિયમ"], 
        B: ["a. કોલકાતા", "b. હૈદરાબાદ", "c. ભોપાલ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 7, q_no: 5, marks: 2, 
        A: ["1. રાષ્ટ્રીય માનવ સંગ્રહાલય", "2. લાલભાઈ દલપતભાઈ ઇન્સ્ટિટ્યૂટ ઓફ ઇન્ડોલોજી"], 
        B: ["a. ભોપાલ", "b. અમદાવાદ", "c. પાટણ"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 7, q_no: 6, marks: 2, 
        A: ["1. શ્રી મહાવીર જૈન આરાધના કેન્દ્ર", "2. શ્રી હેમચંદ્રાચાર્ય જ્ઞાનભંડાર"], 
        B: ["a. કોબા (ગાંધીનગર)", "b. પાટણ", "c. અમદાવાદ"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 7, q_no: 7, marks: 2, 
        A: ["1. મથુરાની રિફાઇનરી", "2. મુંબઈ પ્રાકૃતિક ઇતિહાસ સમિતિ"], 
        B: ["a. પર્યાવરણ અને વન્યજીવોનું રક્ષણ", "b. સલ્ફર ડાયોક્સાઇડથી તાજમહેલને નુકસાન", "c. પ્રવાસન ઉદ્યોગનો વિકાસ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 7, q_no: 8, marks: 2, 
        A: ["1. પ્રવાસન ઉદ્યોગનો ફાયદો", "2. ઐતિહાસિક સ્મારકોનું સમારકામ"], 
        B: ["a. મૂળ સ્વરૂપ અને આકાર જળવાઈ રહે તે રીતે કરવું", "b. સ્થાનિક લોકોને રોજગારી અને આર્થિક લાભ", "c. માત્ર વિદેશીઓને લાભ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 7, q_no: 9, marks: 2, 
        A: ["1. વારસાનું જતન અને રક્ષણ", "2. વિવિધતામાં એકતા"], 
        B: ["a. માત્ર સરકારની જવાબદારી", "b. ભારતની સામાજિક અને નૈતિક ફરજ", "c. ભારતીય સંસ્કૃતિની આગવી વિશેષતા"], 
        ans: ["1 - b", "2 - c"] 
    },
    { 
        chapter: 7, q_no: 10, marks: 2, 
        A: ["1. ભો. જે. વિદ્યાભવન", "2. તાજમહેલની ઝાંખપ દૂર કરવાના પગલાં"], 
        B: ["a. અમદાવાદ", "b. પ્રદૂષણ ફેલાવતા ઉદ્યોગો બંધ કરવા", "c. વડોદરા"], 
        ans: ["1 - a", "2 - b"] 
    },

    { 
        chapter: 8, q_no: 1, marks: 2, 
        A: ["1. રાષ્ટ્રીય સંસાધન", "2. વૈશ્વિક સંસાધન"], 
        B: ["a. દેશનું લશ્કર અને આંતરરાષ્ટ્રીય વ્યાપાર", "b. સમગ્ર દુનિયાની ભૌતિક-અભૌતિક સંપત્તિ", "c. વાતાવરણના ઉપયોગી વાયુઓ"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 8, q_no: 2, marks: 2, 
        A: ["1. સર્વસુલભ સંસાધન", "2. વિરલ સંસાધન"], 
        B: ["a. વાતાવરણમાં રહેલા ઑક્સિજન અને નાઇટ્રોજન", "b. કોલસો, ખનીજ તેલ, તાંબુ, સોનું", "c. ક્રાયોલાઇટ ખનીજ"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 8, q_no: 3, marks: 2, 
        A: ["1. એકલ સંસાધન", "2. નવીનીકરણીય સંસાધન"], 
        B: ["a. સૂર્યપ્રકાશ, પવન અને જંગલો", "b. દુનિયામાં માત્ર ગ્રીનલેન્ડમાંથી મળતું ક્રાયોલાઇટ", "c. કુદરતી વાયુ"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 8, q_no: 4, marks: 2, 
        A: ["1. કાંપની જમીન", "2. કાળી જમીન"], 
        B: ["a. રેગુર કે કપાસની જમીન", "b. ભારતના કુલ 43% ક્ષેત્રફળમાં આવેલી", "c. પડખાઉ જમીન"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 8, q_no: 5, marks: 2, 
        A: ["1. રાતી અથવા લાલ જમીન", "2. પડખાઉ (લેટેરાઇટ) જમીન"], 
        B: ["a. ફેરિક ઓક્સાઇડને કારણે લાલ રંગ", "b. લોહ ઓક્સાઇડને કારણે લાલ રંગ", "c. દ્રાવ્ય ક્ષારોનું વધુ પ્રમાણ"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 8, q_no: 6, marks: 2, 
        A: ["1. રણપ્રકારની જમીન", "2. પર્વતીય જમીન"], 
        B: ["a. હિમાલયમાં 2700 થી 3000 મીટરની ઊંચાઈએ", "b. શુષ્ક અને અર્ધશુષ્ક આબોહવાવાળા વિસ્તારોમાં", "c. ખરેલા પાંદડાઓથી ઢંકાયેલી"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 8, q_no: 7, marks: 2, 
        A: ["1. દલદલ કે પીટ પ્રકારની જમીન", "2. જંગલ પ્રકારની જમીન"], 
        B: ["a. વૃક્ષોના સડેલા પાંદડાંથી ઉપરનો ભાગ કાળો", "b. ચોમાસા દરમિયાન પાણીમાં ડૂબેલી", "c. લાલ રંગની"], 
        ans: ["1 - b", "2 - a"] 
    },
    { 
        chapter: 8, q_no: 8, marks: 2, 
        A: ["1. પડતર જમીનમાં ધોવાણ અટકાવવા", "2. પર્વતીય ઢોળાવો પર ધોવાણ અટકાવવા"], 
        B: ["a. વૃક્ષોનું વાવેતર કરવું", "b. સીડીદાર પદ્ધતિથી ખેતી કરવી", "c. આડબંધ બાંધવા"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 8, q_no: 9, marks: 2, 
        A: ["1. રણને આગળ વધતું અટકાવવા", "2. ઢોળાવવાળી જમીન"], 
        B: ["a. રણની કિનારી પર વૃક્ષોની હારમાળા વાવવી", "b. સમોચ્ચરેખીય પગથિયાંની તરાહથી વાવેતર", "c. માત્ર ઘાસ ઉગાડવું"], 
        ans: ["1 - a", "2 - b"] 
    },
    { 
        chapter: 8, q_no: 10, marks: 2, 
        A: ["1. જમીન ધોવાણ", "2. ભૂમિસંરક્ષણ"], 
        B: ["a. જમીનનું ધોવાણ રોકી તેની ગુણવત્તા જાળવવી", "b. ગતિશીલ હવા કે જળ દ્વારા જમીનના કણોનું ઘસડાવું", "c. પડતર જમીન વધારવી"], 
        ans: ["1 - b", "2 - a"] 
    }











];
